Tekla.Structures.Drawing.View.ViewShorteningAttributes
The ViewShorteningAttributes class sets the shortening attributes for the view.
If CutParts is set to true, the other values are applied. If it is false, none of the other values matter.

Tekla.Structures.Drawing.View.ViewShorteningAttributes.CutParts
Defines whether cut parts are enabled (true) or disabled (false).

Tekla.Structures.Drawing.View.ViewShorteningAttributes.CutPartType
Defines cut part type. Not used if CutParts is false.

Tekla.Structures.Drawing.View.ViewShorteningAttributes.CutSkewParts
Defines whether cut skewed parts are enabled (true) or disabled (false).

Tekla.Structures.Drawing.View.ViewShorteningAttributes.MinimumLength
The minimum cut part length.

Tekla.Structures.Drawing.View.ViewShorteningAttributes.Offset
The space between the cut parts.

Tekla.Structures.Drawing.View.ViewShorteningAttributes.#ctor
Creates a new default view shortening attributes instance.

Tekla.Structures.Drawing.View.ViewShorteningAttributes.#ctor(System.Boolean,System.Boolean,System.Double,System.Double,Tekla.Structures.Drawing.View.ShorteningCutPartType)
Creates a new view shortening attributes instance with the given parameters.
CutParts: A value indicating whether cut parts are enabled.
CutSkewParts: A value indicating whether cut skewed parts are enabled.
MinimumLength: The minimum cut part length.
Offset: The space between the cut parts.
CutPartType: The optional cut part direction type.

Tekla.Structures.Drawing.View.ViewShorteningAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.